# CannotCopySelectedPick Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CopyPasteFailures..::..CannotCopySelectedPick Property
BuiltInFailures..::..CopyPasteFailures Class See Also
---
The element being dragged can't be copied.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCopySelectedPick { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCopySelectedPick As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCopySelectedPick {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CopyPasteFailures Class
Autodesk.Revit.DB Namespace